# import sys
#
#
# STEP = 2 ** 16
# num = 1
# for _ in range(30):  # _ - переменная нам не нужна
#     print(sys.getsizeof(num), num)
#     num *= STEP
#
# num = 7_901_123_456_789  # символ подчёркивания для удобного
# # представления больших чисел
# print(num)


# num = 2 ** 16 - 1
# b = bin(num)
# o = oct(num)
# h = hex(num)
# print(b, o, h)


# 01:09:00
"""
Вещественные числа

Разберём на примерах

float(x) - возвращает число с плавающей запятой,
           составленное из числа или строки х
"""

# print(0.1 + 0.2)
# pi = 3.141_592_653_589_793_248_462_643_383_279_502_884_197_169_399_375
# print(pi)
# """
# 0.30000000000000004
# 3.141592653589793
# """

"""
Логические типы

Разберём на примерах

bool(x) - возвращает логическое значение, т.е.
          одно из двух: True или False
"""
# 01:12:00
